fsopt.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-28 Wed 18:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Formulating Existing Force Structure Optimization</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="tom" />
</head>
<body>
<div id="content">
<h1 class="title">Formulating Existing Force Structure Optimization</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbee5cbe">1. Introduction</a></li>
<li><a href="#org90dfa2c">2. Sets</a></li>
<li><a href="#org0291615">3. Parameters</a></li>
<li><a href="#org641a886">4. Variables</a></li>
<li><a href="#orgc38cbb8">5. Constraints</a>
<ul>
<li><a href="#orgf7f7423">5.1. Fills</a></li>
<li><a href="#org91b11ba">5.2. Total Weighted Fill</a></li>
<li><a href="#org2ea420f">5.3. Total Excess Fill</a></li>
<li><a href="#org6c16b17">5.4. End Strength</a>
<ul>
<li><a href="#org15f5738">5.4.1. Deviation</a></li>
</ul>
</li>
<li><a href="#org854574f">5.5. Objectives</a></li>
</ul>
</li>
<li><a href="#org776b96c">6. Additional Goals</a>
<ul>
<li><a href="#org28787e5">6.1. Deviation From Original Supply</a></li>
<li><a href="#org25c8f4c">6.2. Additional Parameters</a></li>
<li><a href="#org48f2d4a">6.3. Additional Variables</a></li>
<li><a href="#orgaa9928f">6.4. Additional Constraints</a></li>
</ul>
</li>
<li><a href="#org98ff646">7. Revised Objective</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgbee5cbe" class="outline-2">
<h2 id="orgbee5cbe"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
A formulation for a MIP goal program to formalize force structure optimization.
</p>
</div>
</div>

<div id="outline-container-org90dfa2c" class="outline-2">
<h2 id="org90dfa2c"><span class="section-number-2">2</span> Sets</h2>
<div class="outline-text-2" id="text-2">
<p>
\(SRCS\) <br />
\(phases\) 
</p>
</div>
</div>

<div id="outline-container-org0291615" class="outline-2">
<h2 id="org0291615"><span class="section-number-2">3</span> Parameters</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><code>weight(phase)</code> The priority weighting by phase, summing to unity.</li>
<li><code>excess(SRC,phase,n)</code> The excess fill by src, in a phase, if supply level n is chosen.</li>
<li><code>demandmet(SRC,phase,n)</code> The demand met by src, in a phase, if supply level n is chosen.</li>
<li><code>strength(SRC,n)</code>  The total strength associated with src, is supply level n is chosen.</li>
<li><code>lower(SRC)</code>  The lower bound for supply level n for src.</li>
<li><code>upper(SRC)</code>  The upper bound for supply level n for src.</li>
<li><code>bounds(SRC)</code>  \(\{lower(SRC) ... upper(SRC)\}\)  The integer range of supply levels for src.</li>
<li><code>targetstrength</code> The targeted end strength for our goal program.</li>
</ul>
</div>
</div>

<div id="outline-container-org641a886" class="outline-2">
<h2 id="org641a886"><span class="section-number-2">4</span> Variables</h2>
<div class="outline-text-2" id="text-4">
<p>
We define a few free variables.
</p>

<p>
<code>selected</code> is a binary variable determining if a level of supply for an SRC was chosen:
</p>

<p>
\(\underset{\forall SRC \in SRCS \\ \forall n \in bounds(SRC)}{selected(SRC,n)} \in \{0,1\}\)
</p>

<p>
Since we have end-strength goals, we introduce necessary variables to implement absolute
value relations and constraints: 
</p>

<p>
\(posdev \in R_+\) the "chosen" positive deviation for end strength<br />
\(negdev \in R_+\) the "chosen" negative deviation for end strength<br />
</p>

<p>
\(strdev \in R\) surrogate for the relating positive and negative deviation 
</p>
</div>
</div>

<div id="outline-container-orgc38cbb8" class="outline-2">
<h2 id="orgc38cbb8"><span class="section-number-2">5</span> Constraints</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgf7f7423" class="outline-3">
<h3 id="orgf7f7423"><span class="section-number-3">5.1</span> Fills</h3>
<div class="outline-text-3" id="text-5-1">
<p>
&forall; SRC &isin; SRCS
</p>

\begin{equation}
wfill(SRC) = \sum_{n \in bounds(SRC) \\ \forall phase \in phases}weight(phase)*demandmet(SRC,phase,n)*selected(SRC,n)
\end{equation}

\begin{equation}
wexcess(SRC) = \sum_{n \in bounds(SRC) \\ \forall phase \in phases}weight(phase)*excess(SRC,phase,n)*selected(SRC,n)
\end{equation}

\begin{equation}
\sum_{n \in bounds(SRC)}selected(SRC,n) = 1
\end{equation}
</div>
</div>

<div id="outline-container-org91b11ba" class="outline-3">
<h3 id="org91b11ba"><span class="section-number-3">5.2</span> Total Weighted Fill</h3>
<div class="outline-text-3" id="text-5-2">
\begin{equation}
totalfill = \sum_{SRC \in SRCS}wfill(SRC)
\end{equation}
</div>
</div>

<div id="outline-container-org2ea420f" class="outline-3">
<h3 id="org2ea420f"><span class="section-number-3">5.3</span> Total Excess Fill</h3>
<div class="outline-text-3" id="text-5-3">
\begin{equation}
totalexcess = \sum_{SRC \in SRCS}wexcess(SRC)
\end{equation}
</div>
</div>

<div id="outline-container-org6c16b17" class="outline-3">
<h3 id="org6c16b17"><span class="section-number-3">5.4</span> End Strength</h3>
<div class="outline-text-3" id="text-5-4">
\begin{equation}
endstrength = \sum_{\forall SRC \in SRCS \\ \forall n \in bounds(SRC)}{strength(SRC,n)*selected(SRC,n)}
\end{equation}
</div>

<div id="outline-container-org15f5738" class="outline-4">
<h4 id="org15f5738"><span class="section-number-4">5.4.1</span> Deviation</h4>
<div class="outline-text-4" id="text-5-4-1">
<p>
End strength is a goal, which may deviate absolutely. We provide a fill
deviation variable that captures deviation from the expectation.
</p>

<p>
Strength deviation is the measure of observed strength less the target. It may
be positive or negative.
</p>

\begin{equation}
	strengthdev = posdev - negdev
\end{equation}

<p>
Absolute strength deviation is the sum of our two positive variables, this
represents \(\mid strengthdev \mid\), which will contribute to the objective.
</p>

\begin{equation}
	absstrengthdev = posdev + negdev
\end{equation}

<p>
Codify our endstrength goal.
</p>

\begin{equation}
  endstrength + strengthdev = target
\end{equation}
</div>
</div>
</div>


<div id="outline-container-org854574f" class="outline-3">
<h3 id="org854574f"><span class="section-number-3">5.5</span> Objectives</h3>
<div class="outline-text-3" id="text-5-5">
<p>
In the legacy example, we have 2 objectives that are
maximized hierarchically.
</p>

<p>
We want to select a force structure where 
</p>

<ul class="org-ul">
<li>we minimize deviation from the force structure target</li>
<li>maximize (or preserve) weighted fill</li>
<li>maximize (or preserve) weighted excess</li>
</ul>

\begin{equation}

\min absstrengthdev \\
\max totalfill      \\
\max totalexcess    \\

\end{equation}

<p>
We could formulate this as a composite weighted objective function
using the Big M method or similar (weights may need adjusting):
</p>

\begin{equation}

\max z = -10000*absstrengthdev + 1000*totalfill + totalexcess   

\end{equation}
</div>
</div>
</div>

<div id="outline-container-org776b96c" class="outline-2">
<h2 id="org776b96c"><span class="section-number-2">6</span> Additional Goals</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org28787e5" class="outline-3">
<h3 id="org28787e5"><span class="section-number-3">6.1</span> Deviation From Original Supply</h3>
<div class="outline-text-3" id="text-6-1">
<p>
We can also codify a desire to retain the original balance of 
structure as much as possible by choosing to deviate as little as possible
from some baseline for each SRC.
</p>
</div>
</div>

<div id="outline-container-org25c8f4c" class="outline-3">
<h3 id="org25c8f4c"><span class="section-number-3">6.2</span> Additional Parameters</h3>
<div class="outline-text-3" id="text-6-2">
<p>
\(baseline(SRC) \in bounds(SRC)\)
</p>
</div>
</div>

<div id="outline-container-org48f2d4a" class="outline-3">
<h3 id="org48f2d4a"><span class="section-number-3">6.3</span> Additional Variables</h3>
<div class="outline-text-3" id="text-6-3">
<p>
\(posSRCdev(SRC)\) &isin; R_+ "chosen" positive deviation in SRC structure<br />
\(negSRCdev(SRC)\) &isin; R_+ "chosen" negative deviation in SRC structure<br />
\(SRCdev(SRC)\) &isin; R surrogate for relating positive and negative structure deviation
</p>
</div>
</div>

<div id="outline-container-orgaa9928f" class="outline-3">
<h3 id="orgaa9928f"><span class="section-number-3">6.4</span> Additional Constraints</h3>
<div class="outline-text-3" id="text-6-4">
\begin{equation}
	SRCdev(SRC) = posSRCdev(SRC) - negSRCdev(SRC)
\end{equation}

\begin{equation}
	absSRCdev(SRC) = posSRCdev(SRC) + negSRCdev(SRC)
\end{equation}

<p>
Codify our structure deviation goal:
</p>

<p>
\(\forall SRC \in SRCs\)
</p>
\begin{equation}
  \sum_{n \in bounds(SRC)}selected(SRC,n) + SRCdev = baseline(SRC)
\end{equation}

\begin{equation}
totalSRCdev = \sum_{SRC in SRCS}absSRCdev(SRC)
\end{equation}
</div>
</div>
</div>

<div id="outline-container-org98ff646" class="outline-2">
<h2 id="org98ff646"><span class="section-number-2">7</span> Revised Objective</h2>
<div class="outline-text-2" id="text-7">
\begin{equation}

\min absstrengthdev \\
\max totalfill      \\
\max totalexcess    \\
\min totalSRCdev    \\

\end{equation}

<p>
We could formulate this as a composite weighted objective function
using the Big M method or similar (weights may need adjusting):
</p>

\begin{equation}

\max z = -10000*absstrengthdev + 1000*totalfill + totalexcess -  0.01*totalSRCdev

\end{equation}
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: tom</p>
<p class="date">Created: 2021-04-28 Wed 18:25</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
